====================================================================================================
Layer (type:depth-idx)                             Output Shape              Param #
====================================================================================================
AutoencoderKL                                      [1, 3, 256, 256]          --
├─Encoder: 1-1                                     [1, 8, 32, 32]            --
│    └─Conv2d: 2-1                                 [1, 128, 256, 256]        3,584
│    └─ModuleList: 2-2                             --                        --
│    │    └─DownEncoderBlock2D: 3-1                [1, 128, 128, 128]        738,944
│    │    └─DownEncoderBlock2D: 3-2                [1, 256, 64, 64]          2,690,304
│    │    └─DownEncoderBlock2D: 3-3                [1, 512, 32, 32]          10,754,560
│    │    └─DownEncoderBlock2D: 3-4                [1, 512, 32, 32]          9,443,328
│    └─UNetMidBlock2D: 2-3                         [1, 512, 32, 32]          --
│    │    └─ModuleList: 3-7                        --                        (recursive)
│    │    └─ModuleList: 3-6                        --                        1,051,648
│    │    └─ModuleList: 3-7                        --                        (recursive)
│    └─GroupNorm: 2-4                              [1, 512, 32, 32]          1,024
│    └─SiLU: 2-5                                   [1, 512, 32, 32]          --
│    └─Conv2d: 2-6                                 [1, 8, 32, 32]            36,872
├─Conv2d: 1-2                                      [1, 8, 32, 32]            72
├─Conv2d: 1-3                                      [1, 4, 32, 32]            20
├─Decoder: 1-4                                     [1, 3, 256, 256]          --
│    └─Conv2d: 2-7                                 [1, 512, 32, 32]          18,944
│    └─UNetMidBlock2D: 2-8                         [1, 512, 32, 32]          --
│    │    └─ModuleList: 3-10                       --                        (recursive)
│    │    └─ModuleList: 3-9                        --                        1,051,648
│    │    └─ModuleList: 3-10                       --                        (recursive)
│    └─ModuleList: 2-9                             --                        --
│    │    └─UpDecoderBlock2D: 3-11                 [1, 512, 64, 64]          16,524,800
│    │    └─UpDecoderBlock2D: 3-12                 [1, 512, 128, 128]        16,524,800
│    │    └─UpDecoderBlock2D: 3-13                 [1, 256, 256, 256]        4,855,296
│    │    └─UpDecoderBlock2D: 3-14                 [1, 128, 256, 256]        1,067,648
│    └─GroupNorm: 2-10                             [1, 128, 256, 256]        256
│    └─SiLU: 2-11                                  [1, 128, 256, 256]        --
│    └─Conv2d: 2-12                                [1, 3, 256, 256]          3,459
====================================================================================================
Total params: 83,653,863
Trainable params: 83,653,863
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 443.38
====================================================================================================
Input size (MB): 0.39
Forward/backward pass size (MB): 1580.02
Params size (MB): 167.31
Estimated Total Size (MB): 1747.72
====================================================================================================

Encoder Params: 24,720,356

Notes:
1) Check Zarosky's paper to check which pretrained model its using from Diffusers Package