===============================================================================================
Layer (type:depth-idx)                        Output Shape              Param #
===============================================================================================
UNet2DModel                                   [1, 4, 32, 32]            --
├─Timesteps: 1-1                              [1, 128]                  --
├─TimestepEmbedding: 1-2                      [1, 512]                  --
│    └─Linear: 2-1                            [1, 512]                  66,048
│    └─SiLU: 2-2                              [1, 512]                  --
│    └─Linear: 2-3                            [1, 512]                  262,656
├─Conv2d: 1-3                                 [1, 128, 32, 32]          9,344
├─ModuleList: 1-4                             --                        --
│    └─DownBlock2D: 2-4                       [1, 128, 16, 16]          --
│    │    └─ModuleList: 3-1                   --                        722,688
│    │    └─ModuleList: 3-2                   --                        147,584
│    └─DownBlock2D: 2-5                       [1, 256, 8, 8]            --
│    │    └─ModuleList: 3-3                   --                        2,362,880
│    │    └─ModuleList: 3-4                   --                        590,080
│    └─DownBlock2D: 2-6                       [1, 256, 4, 4]            --
│    │    └─ModuleList: 3-5                   --                        2,625,024
│    │    └─ModuleList: 3-6                   --                        590,080
│    └─DownBlock2D: 2-7                       [1, 512, 4, 4]            --
│    │    └─ModuleList: 3-7                   --                        8,920,064
├─UNetMidBlock2D: 1-5                         [1, 512, 4, 4]            --
│    └─ModuleList: 2-10                       --                        (recursive)
│    │    └─ResnetBlock2D: 3-8                [1, 512, 4, 4]            4,984,320
│    └─ModuleList: 2-9                        --                        --
│    │    └─Attention: 3-9                    [1, 512, 4, 4]            1,051,648
│    └─ModuleList: 2-10                       --                        (recursive)
│    │    └─ResnetBlock2D: 3-10               [1, 512, 4, 4]            4,984,320
├─ModuleList: 1-6                             --                        --
│    └─UpBlock2D: 2-11                        [1, 512, 8, 8]            --
│    │    └─ModuleList: 3-11                  --                        22,297,088
│    │    └─ModuleList: 3-12                  --                        2,359,808
│    └─UpBlock2D: 2-12                        [1, 256, 16, 16]          --
│    │    └─ModuleList: 3-13                  --                        6,758,400
│    │    └─ModuleList: 3-14                  --                        590,080
│    └─UpBlock2D: 2-13                        [1, 256, 32, 32]          --
│    │    └─ModuleList: 3-15                  --                        5,774,592
│    │    └─ModuleList: 3-16                  --                        590,080
│    └─UpBlock2D: 2-14                        [1, 128, 32, 32]          --
│    │    └─ModuleList: 3-17                  --                        1,789,952
├─GroupNorm: 1-7                              [1, 128, 32, 32]          256
├─SiLU: 1-8                                   [1, 128, 32, 32]          --
├─Conv2d: 1-9                                 [1, 4, 32, 32]            4,612
===============================================================================================
Total params: 67,481,604
Trainable params: 67,481,604
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 6.34
===============================================================================================
Input size (MB): 0.03
Forward/backward pass size (MB): 53.54
Params size (MB): 269.93
Estimated Total Size (MB): 323.50
===============================================================================================